## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.container_group.azurerm_container_group.cs2 will be created
  + resource "azurerm_container_group" "cs2" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = [
          + {
              + port     = 27015
              + protocol = "TCP"
            },
          + {
              + port     = 27015
              + protocol = "UDP"
            },
          + {
              + port     = 27020
              + protocol = "UDP"
            },
        ]
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "swedencentral"
      + name                        = (known after apply)
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "cs2-servers"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + tags                        = {
          + "azd-env-name" = "prod"
          + "managed-by"   = "terraform"
          + "project"      = "cs2-servers"
        }

      + container {
          + commands = (known after apply)
          + cpu      = 6
          + image    = "juksuu/cs2:matchup"
          + memory   = 10
          + name     = "cs2"

          + ports {
              + port     = 27015
              + protocol = "TCP"
            }
          + ports {
              + port     = 27015
              + protocol = "UDP"
            }
          + ports {
              + port     = 27020
              + protocol = "UDP"
            }

          + volume {
              + empty_dir  = false
              + mount_path = "/root/cs2-dedicated"
              + name       = "cs_files"
              + read_only  = false
            }
        }
    }

  # module.container_group.random_string.container_name will be created
  + resource "random_string" "container_name" {
      + id          = (known after apply)
      + length      = 25
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cs_ip          = (known after apply)
  + fqdn           = (known after apply)
```
</details>